{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "text"}, "name": "text", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "preprocessing", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3"}, "name": "preprocessing", "inbound_nodes": [[["text", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "BERT_encoder", "trainable": true, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/small_bert/bert_en_uncased_L-4_H-512_A-8/1"}, "name": "BERT_encoder", "inbound_nodes": [{"input_word_ids": ["preprocessing", 0, 2, {}], "input_mask": ["preprocessing", 0, 0, {}], "input_type_ids": ["preprocessing", 0, 1, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["BERT_encoder", 0, 5, {}]]]}, {"class_name": "Dense", "config": {"name": "classifier", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "classifier", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["text", 0, 0]], "output_layers": [["classifier", 0, 0]]}}, "training_config": {"loss": {"class_name": "BinaryCrossentropy", "config": {"reduction": "auto", "name": "binary_crossentropy", "from_logits": false, "label_smoothing": 0}}, "metrics": [[{"class_name": "BinaryAccuracy", "config": {"name": "binary_accuracy", "dtype": "float32", "threshold": 0.5}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "AdamWeightDecay", "config": {"name": "AdamWeightDecay", "learning_rate": {"class_name": "WarmUp", "config": {"initial_learning_rate": 3e-05, "decay_schedule_fn": {"class_name": "PolynomialDecay", "config": {"initial_learning_rate": 3e-05, "decay_steps": 3125, "end_learning_rate": 0.0, "power": 1.0, "cycle": false, "name": null}, "__passive_serialization__": true}, "warmup_steps": 312, "power": 1.0, "name": null}}, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-06, "amsgrad": false, "weight_decay_rate": 0.01}}}}, "weightsManifest": [{"paths": ["group1-shard1of28.bin", "group1-shard2of28.bin", "group1-shard3of28.bin", "group1-shard4of28.bin", "group1-shard5of28.bin", "group1-shard6of28.bin", "group1-shard7of28.bin", "group1-shard8of28.bin", "group1-shard9of28.bin", "group1-shard10of28.bin", "group1-shard11of28.bin", "group1-shard12of28.bin", "group1-shard13of28.bin", "group1-shard14of28.bin", "group1-shard15of28.bin", "group1-shard16of28.bin", "group1-shard17of28.bin", "group1-shard18of28.bin", "group1-shard19of28.bin", "group1-shard20of28.bin", "group1-shard21of28.bin", "group1-shard22of28.bin", "group1-shard23of28.bin", "group1-shard24of28.bin", "group1-shard25of28.bin", "group1-shard26of28.bin", "group1-shard27of28.bin", "group1-shard28of28.bin"], "weights": [{"name": "word_embeddings/embeddings", "shape": [30522, 512], "dtype": "float32"}, {"name": "position_embedding/embeddings", "shape": [512, 512], "dtype": "float32"}, {"name": "type_embeddings/embeddings", "shape": [2, 512], "dtype": "float32"}, {"name": "embeddings/layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "embeddings/layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_0/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_0/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_1/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_1/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_2/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_2/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_2/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_2/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/query/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/query/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/key/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/key/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/value/kernel", "shape": [512, 8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/value/bias", "shape": [8, 64], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/attention_output/kernel", "shape": [8, 64, 512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention/attention_output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/self_attention_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/intermediate/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "transformer/layer_3/intermediate/bias", "shape": [2048], "dtype": "float32"}, {"name": "transformer/layer_3/output/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "transformer/layer_3/output/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/output_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_3/output_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "pooler_transform/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "pooler_transform/bias", "shape": [512], "dtype": "float32"}, {"name": "Variable", "shape": [], "dtype": "bool"}, {"name": "classifier/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "classifier/bias", "shape": [1], "dtype": "float32"}]}]}